Tekla Open API Reference for Tekla Structures 2025
RebarGuideline.GuidelineChamferTypeEnum Enumeration
 The guideline chamfer types. For use when creating longitudinal bars on the top/bottom face of a flat polybeam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum GuidelineChamferTypeEnum
Public Enumeration GuidelineChamferTypeEnum
Members
Member name | Value | Description
NONE | 0 |  No chamfer.
ARC_POINT | 1 |  Arc point chamfer.
See Also
Reference
Tekla.Structures.Model Namespace